app/views/sections/list.html.erb

SELECT COUNT(*) AS count_id FROM `sections`
SELECT `sections`.* FROM `sections` ORDER BY Sections.position ASC
---

	<div class='scrap'><%= pluralize(@sections.size, 'section') %> found</div>

SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 1) LIMIT 1
SELECT `subjects`.* FROM `subjects` WHERE (`subjects`.`id` = 1) LIMIT 1
---
			<td>
				<%= link_to(section.page.subject.name, {:controller => 'subjects', :action => 'show', :id => section.page.subject.id}) %>