app/views/sections/list.html.erb

			<td><%= page.permalink %></td>
			<td><%= page.sections.size %></td>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (`sections`.`page_id` = 1)) AS subquery
SELECT `sections`.* FROM `sections` WHERE (`sections`.`page_id` = 1) ORDER BY sections.position ASC