app/views/sections/show.html.erb

SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 1) LIMIT 1
---
			<td>
				<% if @section.page.nil? %>