app/views/pages/list.html.erb


	<div class='scrap'><%= pluralize(@pages.size, 'page') %> found</div>
---
SELECT COUNT(*) AS count_id FROM `pages`
SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC

			<td><%= page.name %></td>
			<td><%= link_to(page.sections.size, {:controller => 'sections', :page_id =>page.id}) %></td>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (`sections`.page_id = 1)) AS subquery