app/views/pages/show.html.erb

			<th>Sections</th>
			<td><%= @page.sections.size %></td>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (`sections`.page_id = 1)) AS subquery