app/views/subjects/list.html.erb


	<div class='scrap'><%= pluralize(@subjects.size, 'subject') %> found</div>
---
SELECT COUNT(*) AS count_id FROM `subjects`
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC

			<td class='center'><%= status_tag(subject.visible) %></td>
			<td class='center'><%= link_to(subject.pages.size, {:controller => 'pages', :action => 'list', :subject_id => subject.id}) %></td>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `pages` WHERE (`pages`.subject_id = 1)) AS subquery