app/views/subjects/show.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `pages` WHERE (`pages`.subject_id = 1)) AS subquery
---
			<th>Pages</th>
			<td><%= link_to(@subject.pages.size, {:controller => 'pages', :action => 'list', :subject_id => @subject.id}) %></td>