app/controllers/admin_users_controller.rb

	def edit
		@admin_user = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE (`admin_users`.`id` = 2) LIMIT 1

	def update
		@admin_user = AdminUser.find(params[:id])
		if @admin_user.update_attributes(params[:admin_user])
---
SELECT `admin_users`.* FROM `admin_users` WHERE (`admin_users`.`id` = 2) LIMIT 1
UPDATE `admin_users` SET `hashed_password` = 'a187e9f8dcb7f7702367fbc3b96586cd9dcc24b9', `salt` = '9487d50d771337b0f2e6a09454fbd26ef22df597', `updated_at` = '2014-04-23 14:56:42' WHERE (`admin_users`.`id` = 2)

	def delete
		@admin_user = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE (`admin_users`.`id` = 1) LIMIT 1