app/controllers/pages_controller.rb

SELECT `subjects`.* FROM `subjects` WHERE (`subjects`.`id` = 1) LIMIT 1
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `pages` WHERE (`pages`.`subject_id` = 1)) AS subquery
SELECT `pages`.* FROM `pages` WHERE (`pages`.`subject_id` = 1) ORDER BY pages.position ASC
---
	def list
		if @subject.nil?
			@subject = Subject.find(1)
			@pages = Page.sorted
		else
			@pages = Page.sorted.where(:subject_id => @subject.id)

SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 1) LIMIT 1
---
	def show
		@page = Page.find(params[:id])

SELECT id FROM `subjects` ORDER BY subjects.id ASC
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `pages` WHERE (`pages`.subject_id = 2)) AS subquery
---
	def new
		@page = Page.new(:subject_id => @subject.id)
		@subject_id_array = Subject.order("subjects.id ASC").all(:select => :id).collect(&:id)
		@page_count = @subject.pages.size + 1

INSERT INTO `pages` (`created_at`, `name`, `permalink`, `position`, `subject_id`, `updated_at`, `visible`) VALUES ('2014-04-23 02:13:05', 'Test page', NULL, 4, NULL, '2014-04-23 02:13:05', 1)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `pages` WHERE (`pages`.subject_id = 2)) AS subquery
SELECT id FROM `subjects` ORDER BY subjects.id ASC
---
	def create
		new_position = params[:page].delete(:position)
		# Instantiate a new object using form parameters
		@page = Page.new(params[:page])
		# Save the object
		if @page.save
			@page.move_to_position(new_position)
			# If save succeeds, refirect to the list action
			flash[:notice] = "Page created successfully."
			redirect_to(:action => 'list', :subject_id => @page.subject_id)
		else
			# If save filas, redisplay the form so user can fix problems
			@page_count = @subject.pages.size + 1
			@subject_id_array = Subject.order("subjects.id ASC").all(:select => :id).collect(&:id)

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `pages` WHERE (`pages`.subject_id = 2)) AS subquery
SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 5) LIMIT 1
SELECT name FROM `subjects` ORDER BY subjects.name ASC
SELECT COUNT(*) AS count_id FROM `pages`
---
	def edit
		@page = Page.find(params[:id])
		@subject_id_array = Subject.order("subjects.id ASC").all(:select => :id).collect(&:id)
		@page_count = @subject.pages.size

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `pages` WHERE (`pages`.subject_id = 2)) AS subquery
SELECT `pages`.* FROM `pages` WHERE (position >= 1 AND position <= 4 AND pages.subject_id = 1)
UPDATE `pages` SET `name` = 'Second Test Page', `permalink` = 'second', `updated_at` = '2014-04-24 04:34:23', `visible` = 1 WHERE (`pages`.`id` = 11)
SELECT COUNT(*) AS count_id FROM `pages`
SELECT id FROM `subjects` ORDER BY subjects.id ASC
---
	def update
		new_position = params[:page].delete(:position)
		# Find a new object using form parameters
		@page = Page.find(params[:id])
		# Update the object
		if @page.update_attributes(params[:page])
			@page.move_to_position(new_position)
			# If save succeeds, refirect to the list action
			flash[:notice] = "Page updated successfully."
			redirect_to(:action => 'show', :id => @page.id, :subject_id => @page.subject_id)
		else
			# If save filas, redisplay the form so user can fix problems
			@page_count = @subject.pages.size
			@subject_id_array = Subject.order("subjects.id ASC").all(:select => :id).collect(&:id)

SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 5) LIMIT 1
---
	def delete
		# Find a new object using form parameters
		@page = Page.find(params[:id])

SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 5) LIMIT 1
DELETE FROM `pages` WHERE (`pages`.`id` = 5)
---
	def destroy
		page = Page.find(params[:id])
		page.move_to_position(nil)
		page.destroy

SELECT `subjects`.* FROM `subjects` WHERE (`subjects`.`id` = 11) LIMIT 1
---
	def find_subject
		if params[:subject_id]
			@subject = Subject.find_by_id(params[:subject_id])