app/controllers/pages_controller.rb

	def list
		@pages = Page.order("pages.position ASC")
---
SELECT COUNT(*) AS count_id FROM `pages`
SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC