app/controllers/public_controller.rb

SELECT `pages`.* FROM `pages` WHERE (`pages`.`permalink` = 'first') AND (`pages`.`visible` = 1) LIMIT 1
---
	def show
		@page = Page.where(:permalink => params[:id], :visible => true).first