app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections` ORDER BY Sections.position ASC
---
	def list
		@sections = Section.order("sections.position ASC")