app/controllers/sections_controller.rb

SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 1) LIMIT 1
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (`sections`.`page_id` = 1)) AS subquery
SELECT `sections`.* FROM `sections` WHERE (`sections`.`page_id` = 1) ORDER BY sections.position ASC
---
	def list
		if @page.nil?
			@page = Page.find(1)
			@sections = Section.sorted
		else
			@sections = Section.sorted.where(:page_id => @page.id)

SELECT `sections`.* FROM `sections` WHERE (`sections`.`id` = 4) LIMIT 1
---
	def show
		@section = Section.find(params[:id])

SELECT id, name FROM `pages` ORDER BY pages.id ASC
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (`sections`.page_id = 1)) AS subquery
---
	def new
		@section = Section.new
		@page_id_array = Page.order("pages.id ASC").all(:select => :id).collect(&:id)
		@section_count = @page.sections.count + 1

INSERT INTO `sections` (`content`, `content_type`, `created_at`, `name`, `page_id`, `position`, `updated_at`, `visible`) VALUES ('', NULL, '2014-04-23 03:39:38', '', NULL, NULL, '2014-04-23 03:39:38', 0)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (`sections`.page_id = 3)) AS subquery
SELECT id FROM `pages` ORDER BY pages.id ASC
---
	def create
		new_position = params[:section].delete(:position)
		# Instantiate a new object using form parameters
		@section = Section.new(params[:section])
		# Save the object
		if @section.save
			@section.move_to_position(new_position)
			# If save succeeds, refirect to the list action
			flash[:notice] = "Section created successfully."
			redirect_to(:action => 'list', :page_id => params[:page_id])
		else
			# If save filas, redisplay the form so user can fix problems
			@section_count = @page.sections.count + 1
			@page_id_array = Page.order("pages.id ASC").all(:select => :id).collect(&:id)

SELECT `sections`.* FROM `sections` WHERE (`sections`.`id` = 4) LIMIT 1
SELECT id FROM `pages` ORDER BY pages.id ASC
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (`sections`.page_id = 1)) AS subquery
---
	def edit
		@section = Section.find(params[:id])
		@page_id_array = Page.order("pages.id ASC").all(:select => :id).collect(&:id)
		@section_count = @page.sections.count

SELECT `sections`.* FROM `sections` WHERE (`sections`.`id` = 4) LIMIT 1
UPDATE `sections` SET `content` = 'Second Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section ContentSecond Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section Content\r\nSecond Section Content', `updated_at` = '2014-04-23 06:15:30' WHERE (`sections`.`id` = 2)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `sections` WHERE (sections.page_id = 3)) AS subquery
SELECT id FROM `pages` ORDER BY pages.id ASC
---
	def update
		new_position = params[:section].delete(:position)
		# Find a new object using form parameters
		@section = Section.find(params[:id])
		# Update the object
		if @section.update_attributes(params[:section])
			@section.move_to_position(new_position)
			# If save succeeds, refirect to the list action
			flash[:notice] = "Section updated successfully."
			redirect_to(:action => 'show', :id => @section.id, :page_id => params[:page_id])
		else
			# If save filas, redisplay the form so user can fix problems
			@section_count = @page.sections.count
			@page_id_array = Page.order("pages.id ASC").all(:select => :id).collect(&:id)

SELECT `sections`.* FROM `sections` WHERE (`sections`.`id` = 4) LIMIT 1
---
	def delete
		# Find a new object using form parameters
		@section = Section.find(params[:id])

SELECT `sections`.* FROM `sections` WHERE (`sections`.`id` = 4) LIMIT 1
DELETE FROM `sections` WHERE (`sections`.`id` = 4)
---
	def destroy
		section = Section.find(params[:id])
		section.move_to_position(nil)
		section.destroy

SELECT `pages`.* FROM `pages` WHERE (`pages`.`id` = 3) LIMIT 1
---
	def find_page
		if params[:page_id]
			@page = Page.find_by_id(params[:page_id])