app/controllers/subjects_controller.rb

	def list
		@subjects = Subject.order("subjects.position ASC")
---
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC

	def show
		@subject = Subject.find(params[:id])
---
SELECT `subjects`.* FROM `subjects` WHERE (`subjects`.`id` = 1) LIMIT 1

	def new
		@subject = Subject.new(:name => 'default')
		@subject_count = Subject.count + 1
---
SELECT COUNT(*) AS count_id FROM `subjects`

	def create
		new_position = params[:subject].delete(:position)
		# Instantiate a new object using form parameters
		@subject = Subject.new(params[:subject])
		# Save the object
		if @subject.save
			@subject.move_to_position(new_position)
			# If save succeeds, refirect to the list action
			flash[:notice] = "Subject created successfully."
			redirect_to(:action => 'list')
		else
			# If save filas, redisplay the form so user can fix problems
			@subject_count = Subject.count + 1
---
INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`, `visible`) VALUES ('2014-04-22 12:54:20', 'Test Subject', 5, '2014-04-22 12:54:20', 1)
SELECT COUNT(*) AS count_id FROM `subjects`

	def edit
		@subject = Subject.find(params[:id])
		@subject_count = Subject.count
---
SELECT `subjects`.* FROM `subjects` WHERE (`subjects`.`id` = 2) LIMIT 1
SELECT COUNT(*) AS count_id FROM `subjects`

	def update
		# Find a new object using form parameters
		@subject = Subject.find(params[:id])
		# Update the object
		new_position = params[:subject].delete(:position)
		if @subject.update_attributes(params[:subject])
			@subject.move_to_position(new_position)
			# If save succeeds, refirect to the list action
			flash[:notice] = "Subject updated successfully."
			redirect_to(:action => 'show', :id => @subject.id)
		else
			# If save filas, redisplay the form so user can fix problems
			@subject_count = Subject.count
---
SELECT `subjects`.* FROM `subjects` WHERE (position >= 1 AND position <= 3 AND 1 = 1)
UPDATE `subjects` SET `created_at` = '2014-04-23 01:53:00', `updated_at` = '2014-04-24 02:53:29' WHERE (`subjects`.`id` = 11)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `subjects` WHERE (1 = 1)) AS subquery

	def delete
		# Find a new object using form parameters
		@subject = Subject.find(params[:id])
---
SELECT `subjects`.* FROM `subjects` WHERE (`subjects`.`id` = 6) LIMIT 1

	def destroy
		subject = Subject.find(params[:id])
		subject.move_to_position(nil)
		subject.destroy
---
SELECT `subjects`.* FROM `subjects` WHERE (position >= 2 AND position <= 1000000 AND 1 = 1)
DELETE FROM `subjects` WHERE (`subjects`.`id` = 6)