app/views/public/show.html.erb

SELECT `sections`.* FROM `sections` WHERE (`sections`.page_id = 1) AND (`sections`.`visible` = 1) ORDER BY sections.position ASC
---

<% @page.sections.visible.sorted.each do |section| %>