app/views/layouts/_navigation.html.erb

			<ul>
				<% subject.pages.visible.sorted.each do |page| %>
---
SELECT `pages`.* FROM `pages` WHERE (`pages`.subject_id = 1) AND (`pages`.`visible` = 1) ORDER BY pages.position ASC